// Задача 19
// Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
// 14212 -> нет
// 12821 -> да
// 23432 -> да

Console.WriteLine("Введите пятизначное число: ");
int num1 = Convert.ToInt32 (Console.ReadLine());
if (num1 < 9999)
Console.WriteLine("Число не является пятизначным ");
else
{
    
}